pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
	</registers>
</peripheral>

		<peripheral>
	<name>GPDMA</name>
	<description>General Purpose DMA controller Modification</description>
	<groupName>GPDMA</groupName>
	<baseAddress>0x20080000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>GPDMA</name>
	<value>26</value>
	</interrupt>
	<registers>
		<register>
			<name>INTSTAT</name>
			<description>DMA Interrupt Status Register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTSTAT0</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>INTSTAT1</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTSTAT2</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>INTSTAT3</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>INTSTAT4</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTSTAT5</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>INTSTAT6</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>INTSTAT7</name>
					<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTTCSTAT</name>
			<description>DMA Interrupt Terminal Count Request Status Register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTTCSTAT0</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT1</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT2</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT3</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT4</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT5</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT6</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>INTTCSTAT7</name>
					<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTTCCLEAR</name>
			<description>DMA Interrupt Terminal Count Request Clear Register</description>
			<addressOffset>0x008</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>INTTCCLEAR0</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR1</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR2</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR3</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR4</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR5</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR6</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>INTTCCLEAR7</name>
					<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTERRSTAT</name>
			<description>DMA Interrupt Error Status Register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTERRSTAT0</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT1</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT2</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT3</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT4</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT5</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT6</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>INTERRSTAT7</name>
					<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTERRCLR</name>
			<description>DMA Interrupt Error Clear Register</description>
			<addressOffset>0x010</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>INTERRCLR0</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>INTERRCLR1</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>INTERRCLR2</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>INTERRCLR3</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>INTERRCLR4</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTERRCLR5</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>INTERRCLR6</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>INTERRCLR7</name>
					<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RAWINTTCSTAT</name>
			<description>DMA Raw Interrupt Terminal Count Status Register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RAWINTTCSTAT0</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT1</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT2</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT3</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT4</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT5</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT6</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RAWINTTCSTAT7</name>
					<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RAWINTERRSTAT</name>
			<description>DMA Raw Error Interrupt Status Register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RAWINTERRSTAT0</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT1</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT2</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT3</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT4</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT5</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT6</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RAWINTERRSTAT7</name>
					<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
