pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
		<register>
			<name>RSV</name>
			<description>Receive status vector register.</description>
			<addressOffset>0x160</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RBC</name>
					<description>Received byte count. Indicates length of received frame.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>PPI</name>
					<description>Packet previously ignored. Indicates that a packet was dropped.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RXDVSEEN</name>
					<description>RXDV event previously seen. Indicates that the last receive event seen was not long enough to be a valid packet.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>CESEEN</name>
					<description>Carrier event previously seen. Indicates that at some time since the last receive statistics, a carrier event was detected.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RCV</name>
					<description>Receive code violation. Indicates that received PHY data does not represent a valid receive code.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>CRCERR</name>
					<description>CRC error. The attached CRC in the packet did not match the internally generated CRC.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>LCERR</name>
					<description>Length check error. Indicates the frame length field does not match the actual number of data items and is not a type field.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>LOR</name>
					<description>Length out of range. Indicates that frame type/length field was larger than 1518 bytes. The EMAC doesn't distinguish the frame type and frame length, so, e.g. when the IP(0x8000) or ARP(0x0806) packets are received, it compares the frame type with the max length and gives the "Length out of range" error. In fact, this bit is not an error indication, but simply a statement by the chip regarding the status of the received frame.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>ROK</name>
					<description>Receive OK. The packet had valid CRC and no symbol errors.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>MULTICAST</name>
					<description>The packet destination was a multicast address.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>BROADCAST</name>
					<description>The packet destination was a broadcast address.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>DRIBBLENIBBLE</name>
					<description>Indicates that after the end of packet another 1-7 bits were received. A single nibble, called dribble nibble, is formed but not sent out.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>CONTROLFRAME</name>
					<description>The frame was a control frame.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PAUSE</name>
					<description>The frame was a control frame with a valid PAUSE opcode.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>UO</name>
					<description>Unsupported Opcode. The current frame was recognized as a Control Frame but contains an unknown opcode.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>VLAN</name>
					<description>Frame's length/type field contained 0x8100 which is the VLAN protocol identifier.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FLOWCONTROLCOUNTER</name>
			<description>Flow control counter register.</description>
			<addressOffset>0x170</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MC</name>
					<description>MirrorCounter. In full duplex mode the MirrorCounter specifies the number of cycles before re-issuing the Pause control frame.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>PT</name>
					<description>PauseTimer. In full-duplex mode the PauseTimer specifies the value that is inserted into the pause timer field of a pause flow control frame. In half duplex mode the PauseTimer specifies the number of backpressure cycles.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FLOWCONTROLSTATUS</name>
			<description>Flow control status register.</description>
			<addressOffset>0x174</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MCC</name>
					<description>MirrorCounterCurrent. In full duplex mode this register represents the current value of the datapath's mirror counter which counts up to the value specified by the MirrorCounter field in the FlowControlCounter register. In half duplex mode the register counts until it reaches the value of the PauseTimer bits in the FlowControlCounter register.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXFILTERCTRL</name>
			<description>Receive filter control register.</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUE</name>
					<description>AcceptUnicastEn. When set to 1, all unicast frames are accepted.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABE</name>
					<description>AcceptBroadcastEn. When set to 1, all broadcast frames are accepted.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AME</name>
					<description>AcceptMulticastEn. When set to 1, all multicast frames are accepted.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHE</name>
					<description>AcceptUnicastHashEn. When set to 1, unicast frames that pass the imperfect hash filter are accepted.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHE</name>
					<description>AcceptMulticastHashEn. When set to 1, multicast frames that pass the imperfect hash filter are accepted.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APE</name>
					<description>AcceptPerfectEn. When set to 1, the frames with a destination address identical to the station address are accepted.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[11:6]</bitRange>
				</field>
				<field>
					<name>MPEW</name>
					<description>MagicPacketEnWoL. When set to 1, the result of the magic packet filter will generate a WoL interrupt when there is a match.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RFEW</name>
					<description>RxFilterEnWoL. When set to 1, the result of the perfect address matching filter and the imperfect hash filter will generate a WoL interrupt when there is a match.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXFILTERWOLSTATUS</name>
			<description>Receive filter WoL status register.</description>
			<addressOffset>0x204</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUW</name>
					<description>AcceptUnicastWoL. When the value is 1, a unicast frames caused WoL.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABW</name>
					<description>AcceptBroadcastWoL. When the value is 1, a broadcast frame caused WoL.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AMW</name>
					<description>AcceptMulticastWoL. When the value is 1, a multicast frame caused WoL.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHW</name>
					<description>AcceptUnicastHashWoL. When the value is 1, a unicast frame that passes the imperfect hash filter caused WoL.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHW</name>
					<description>AcceptMulticastHashWoL. When the value is 1, a multicast frame that passes the imperfect hash filter caused WoL.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APW</name>
					<description>AcceptPerfectWoL. When the value is 1, the perfect address matching filter caused WoL.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RFW</name>
					<description>RxFilterWoL. When the value is 1, the receive filter caused WoL.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MPW</name>
					<description>MagicPacketWoL. When the value is 1, the magic packet filter caused WoL.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXFILTERWOLCLEAR</name>
			<description>Receive filter WoL clear register.</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AUWCLR</name>
					<description>AcceptUnicastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ABWCLR</name>
					<description>AcceptBroadcastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AMWCLR</name>
					<description>AcceptMulticastWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AUHWCLR</name>
					<description>AcceptUnicastHashWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AMHWCLR</name>
					<description>AcceptMulticastHashWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APWCLR</name>
					<description>AcceptPerfectWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RFWCLR</name>
					<description>RxFilterWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>MPWCLR</name>
					<description>MagicPacketWoLClr. When a 1 is written, the corresponding status bit in the RxFilterWoLStatus register is cleared.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HASHFILTERL</name>
			<description>Hash filter table LSBs register.</description>
			<addressOffset>0x210</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HFL</name>
					<description>HashFilterL. Bits 31:0 of the imperfect filter hash table for receive filtering.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HASHFILTERH</name>
			<description>Hash filter table MSBs register.</description>
			<addressOffset>0x214</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HFH</name>
					<description>Bits 63:32 of the imperfect filter hash table for receive filtering.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSTATUS</name>
			<description>Interrupt status register.</description>
			<addressOffset>0xFE0</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINT</name>
					<description>Interrupt set on a fatal overrun error in the receive queue. The fatal interrupt should be resolved by a Rx soft-reset. The bit is not set when there is a nonfatal overrun error.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINT</name>
					<description>Interrupt trigger on receive errors: AlignmentError, RangeError, LengthError, SymbolError, CRCError or NoDescriptor or Overrun.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINT</name>
					<description>Interrupt triggered when all receive descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINT</name>
					<description>Interrupt triggered when a receive descriptor has been processed while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINT</name>
					<description>Interrupt set on a fatal underrun error in the transmit queue. The fatal interrupt should be resolved by a Tx soft-reset. The bit is not set when there is a nonfatal underrun error.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINT</name>
					<description>Interrupt trigger on transmit errors: LateCollision, ExcessiveCollision and ExcessiveDefer, NoDescriptor or Underrun.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINT</name>
					<description>Interrupt triggered when all transmit descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINT</name>
					<description>Interrupt triggered when a descriptor has been transmitted while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINT</name>
					<description>Interrupt triggered by software writing a 1 to the SoftIntSet bit in the IntSet register.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINT</name>
					<description>Interrupt triggered by a Wake-up event detected by the receive filter.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENABLE</name>
			<description>Interrupt enable register.</description>
			<addressOffset>0xFE4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTEN</name>
					<description>Enable for interrupt trigger on receive buffer overrun or descriptor underrun situations.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTEN</name>
					<description>Enable for interrupt trigger on receive errors.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTEN</name>
					<description>Enable for interrupt triggered when all receive descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTEN</name>
					<description>Enable for interrupt triggered when a receive descriptor has been processed while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTEN</name>
					<description>Enable for interrupt trigger on transmit buffer or descriptor underrun situations.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTEN</name>
					<description>Enable for interrupt trigger on transmit errors.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTEN</name>
					<description>Enable for interrupt triggered when all transmit descriptors have been processed i.e. on the transition to the situation where ProduceIndex == ConsumeIndex.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTEN</name>
					<description>Enable for interrupt triggered when a descriptor has been transmitted while the Interrupt bit in the Control field of the descriptor was set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTEN</name>
					<description>Enable for interrupt triggered by the SoftInt bit in the IntStatus register, caused by software writing a 1 to the SoftIntSet bit in the IntSet register.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTEN</name>
					<description>Enable for interrupt triggered by a Wake-up event detected by the receive filter.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTCLEAR</name>
			<description>Interrupt clear register.</description>
			<addressOffset>0xFE8</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXOVERRUNINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RXERRORINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFINISHEDINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RXDONEINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXUNDERRUNINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TXERRORINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TXFINISHEDINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TXDONEINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>SOFTINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>WAKEUPINTCLR</name>
					<description>Writing a 1 clears the corresponding status bit in interrupt status register IntStatus.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
