pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
	</registers>
		</peripheral>
		<peripheral>
	<name>USB</name>
	<description> USB device controller </description>
	<groupName>USB</groupName>
	<baseAddress>0x2008C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>USB</name>
	<value>24</value>
	</interrupt>
	<interrupt>
	<name>USB_NEED_CLK</name>
	<value>33</value>
	</interrupt>
	<registers>
		<register>
			<name>INTST</name>
			<description>OTG Interrupt Status</description>
			<addressOffset>0x100</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TMR</name>
					<description>Timer time-out.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>REMOVE_PU</name>
					<description>Remove pull-up. This bit is set by hardware to indicate that software needs to disable the D+ pull-up resistor.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HNP_FAILURE</name>
					<description>HNP failed. This bit is set by hardware to indicate that the HNP switching has failed.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>HNP_SUCCESS</name>
					<description>HNP succeeded. This bit is set by hardware to indicate that the HNP switching has succeeded.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTEN</name>
			<description>OTG Interrupt Enable</description>
			<addressOffset>0x104</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TMR_EN</name>
					<description>1 = enable the corresponding bit in the IntSt register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>REMOVE_PU_EN</name>
					<description>1 = enable the corresponding bit in the IntSt register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HNP_FAILURE_EN</name>
					<description>1 = enable the corresponding bit in the IntSt register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>HNP_SUCCES_EN</name>
					<description>1 = enable the corresponding bit in the IntSt register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSET</name>
			<description>OTG Interrupt Set</description>
			<addressOffset>0x108</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>TMR_SET</name>
					<description>0 = no effect. 1 = set the corresponding bit in the IntSt register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>REMOVE_PU_SET</name>
					<description>0 = no effect. 1 = set the corresponding bit in the IntSt register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HNP_FAILURE_SET</name>
					<description>0 = no effect. 1 = set the corresponding bit in the IntSt register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>HNP_SUCCES_SET</name>
					<description>0 = no effect. 1 = set the corresponding bit in the IntSt register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INCLR</name>
			<description>OTG Interrupt Clear</description>
			<addressOffset>0x10C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>TMR_CLR</name>
					<description>0 = no effect. 1 = clear the corresponding bit in the IntSt register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>REMOVE_PU_CLR</name>
					<description>0 = no effect. 1 = clear the corresponding bit in the IntSt register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HNP_FAILURE_CLR</name>
					<description>0 = no effect. 1 = clear the corresponding bit in the IntSt register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>HNP_SUCCES_CLR</name>
					<description>0 = no effect. 1 = clear the corresponding bit in the IntSt register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PORTSEL</name>
			<description>USB Port Select. The USBPortSel register is identical to the OTGStCtrl register (see Section 15.8.6). In device-only operations only bits 0 and 1 of this register are used to control the routing of USB pins to Port 1 or Port 2.</description>
			<addressOffset>0x110</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PORTSEL</name>
					<description>Selects which USB port the device controller signals are mapped to. Other values are reserved.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PORTU1</name>
							<description>The USB device controller signals are mapped to the U1 port: USB_CONNECT1, USB_UP_LED1, USB_D+1, USB_D-1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PORTU2</name>
							<description>The USB device controller signals are mapped to the U2 port: USB_CONNECT2, USB_UP_LED2, USB_D+2, USB_D-2.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TMR_SCALE</name>
					<description>Timer scale selection. This field determines the duration of each timer count. 00: 10 ms (100 KHz) 01: 100 ms (10 KHz) 10: 1000 ms (1 KHz) 11: Reserved</description>
					<bitRange>[3:2]</bitRange>
				</field>
				<field>
					<name>TMR_MODE</name>
					<description>Timer mode selection. 0: monoshot 1: free running</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>TMR_EN</name>
					<description>Timer enable. When set, TMR_CNT increments. When cleared, TMR_CNT is reset to 0.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>TMR_RST</name>
					<description>Timer reset. Writing one to this bit resets TMR_CNT to 0. This provides a single bit control for the software to restart the timer when the timer is enabled.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>B_HNP_TRACK</name>
					<description>Enable HNP tracking for B-device (peripheral), see Section 15.9. Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>A_HNP_TRACK</name>
					<description>Enable HNP tracking for A-device (host), see Section 15.9. Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is set.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>PU_REMOVED</name>
					<description>When the B-device changes its role from peripheral to host, software sets this bit when it removes the D+ pull-up, see Section 15.9. Hardware clears this bit when HNP_SUCCESS or HNP_FAILURE is set.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:11]</bitRange>
				</field>
				<field>
					<name>TMR_CNT</name>
					<description>Current timer count value.</description>
					<bitRange>[31:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:2]</bitRange>

