pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
			</fields>
		</register>
		<register>
			<name>TMR</name>
			<description>OTG Timer</description>
			<addressOffset>0x114</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TIMEOUT_CNT</name>
					<description>The TMR interrupt is set when TMR_CNT reaches this value.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		
		
		
		<register>
			<name>DEVINTST</name>
			<description>USB Device Interrupt Status</description>
			<addressOffset>0x200</addressOffset>
			<access>read-only</access>
			<resetValue>0x10</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAME</name>
					<description>The frame interrupt occurs every 1 ms. This is used in isochronous packet transfers.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FAST</name>
					<description>Fast endpoint interrupt. If an Endpoint Interrupt Priority register (USBEpIntPri) bit is set, the corresponding endpoint interrupt will be routed to this bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOW</name>
					<description>Slow endpoints interrupt. If an Endpoint Interrupt Priority Register (USBEpIntPri) bit is not set, the corresponding endpoint interrupt will be routed to this bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STAT</name>
					<description>Set when USB Bus reset, USB suspend change or Connect change event occurs. Refer to Section 13.12.6 Set Device Status (Command: 0xFE, Data: write 1 byte) on page 366.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTY</name>
					<description>The command code register (USBCmdCode) is empty (New command can be written).</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULL</name>
					<description>Command data register (USBCmdData) is full (Data can be read now).</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKT</name>
					<description>The current packet in the endpoint buffer is transferred to the CPU.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKT</name>
					<description>The number of data bytes transferred to the endpoint buffer equals the number of bytes programmed in the TxPacket length register (USBTxPLen).</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZED</name>
					<description>Endpoints realized. Set when Realize Endpoint register (USBReEp) or MaxPacketSize register (USBMaxPSize) is updated and the corresponding operation is completed.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INT</name>
					<description>Error Interrupt. Any bus error interrupt from the USB device. Refer to Section 13.12.9 Read Error Status (Command: 0xFB, Data: read 1 byte) on page 368</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DEVINTEN</name>
			<description>USB Device Interrupt Enable</description>
			<addressOffset>0x204</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMEEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTEN</name>
					<description>0 = No interrupt is generated. 1 = An interrupt will be generated when the corresponding bit in the Device Interrupt Status (USBDevIntSt) register (Table 261) is set. By default, the interrupt is routed to the USB_INT_REQ_LP interrupt line. Optionally, either the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP interrupt line by changing the value of USBDevIntPri.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DEVINTCLR</name>
			<description>USB Device Interrupt Clear</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMECLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DEVINTSET</name>
			<description>USB Device Interrupt Set</description>
			<addressOffset>0x20C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMESET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DEVINTPRI</name>
			<description>USB Device Interrupt Priority</description>
			<addressOffset>0x22C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAME</name>
					<description>Frame interrupt routing</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LP</name>
							<description>FRAME interrupt is routed to USB_INT_REQ_LP.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HP</name>
							<description>FRAME interrupt is routed to USB_INT_REQ_HP.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EP_FAST</name>
					<description>Fast endpoint interrupt routing</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LP</name>
							<description>EP_FAST interrupt is routed to USB_INT_REQ_LP.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HP</name>
							<description>EP_FAST interrupt is routed to USB_INT_REQ_HP.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:2]</bitRange>

