pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
			</fields>
		</register>
		<register>
			<name>EPINTST</name>
			<description>USB Endpoint Interrupt Status</description>
			<addressOffset>0x230</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPST0</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPST1</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPST2</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPST3</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPST4</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPST5</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPST6</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPST7</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPST8</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPST9</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPST10</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPST11</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPST12</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPST13</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPST14</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPST15</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPST16</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPST17</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPST18</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPST19</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPST20</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPST21</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPST22</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPST23</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPST24</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPST25</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPST26</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPST27</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPST28</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPST29</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPST30</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPST31</name>
					<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPINTEN</name>
			<description>USB Endpoint Interrupt Enable</description>
			<addressOffset>0x234</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPEN0</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPEN1</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPEN2</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPEN3</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPEN4</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPEN5</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPEN6</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPEN7</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPEN8</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPEN9</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPEN10</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPEN11</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPEN12</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPEN13</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPEN14</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPEN15</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPEN16</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPEN17</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPEN18</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPEN19</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPEN20</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPEN21</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPEN22</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPEN23</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPEN24</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPEN25</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPEN26</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPEN27</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPEN28</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPEN29</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPEN30</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPEN31</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
