pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
		<register>
			<name>REEP</name>
			<description>USB Realize Endpoint</description>
			<addressOffset>0x244</addressOffset>
			<access>read-write</access>
			<resetValue>0x3</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPR0</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPR1</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPR2</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPR3</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPR4</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPR5</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPR6</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPR7</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPR8</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPR9</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPR10</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPR11</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPR12</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPR13</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPR14</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPR15</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPR16</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPR17</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPR18</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPR19</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPR20</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPR21</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPR22</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPR23</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPR24</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPR25</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPR26</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPR27</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPR28</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPR29</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPR30</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPR31</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPIN</name>
			<description>USB Endpoint Index</description>
			<addressOffset>0x248</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PHY_EP</name>
					<description>Physical endpoint number (0-31)</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAXPSIZE</name>
			<description>USB MaxPacketSize</description>
			<addressOffset>0x24C</addressOffset>
			<access>read-write</access>
			<resetValue>0x8</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MPS</name>
					<description>The maximum packet size value.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXDATA</name>
			<description>USB Receive Data</description>
			<addressOffset>0x218</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RX_DATA</name>
					<description>Data received.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXPLEN</name>
			<description>USB Receive Packet Length</description>
			<addressOffset>220</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PKT_LNGTH</name>
					<description>The remaining number of bytes to be read from the currently selected endpoint's buffer. When this field decrements to 0, the RxENDPKT bit will be set in USBDevIntSt.</description>
					<bitRange>[9:0]</bitRange>

