pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>DV</name>
					<description>Data valid. This bit is useful for isochronous endpoints. Non-isochronous endpoints do not raise an interrupt when an erroneous data packet is received. But invalid data packet can be produced with a bus reset. For isochronous endpoints, data transfer will happen even if an erroneous packet is received. In this case DV bit will not be set for the packet.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DATA_IS_INVALID_</name>
							<description>Data is invalid.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_IS_VALID_</name>
							<description>Data is valid.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PKT_RDY</name>
					<description>The PKT_LNGTH field is valid and the packet is ready for reading.</description>
					<bitRange>[11:11]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:12]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>TXDATA</name>
			<description>USB Transmit Data</description>
			<addressOffset>0x21C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TX_DATA</name>
					<description>Transmit Data.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXPLEN</name>
			<description>USB Transmit Packet Length</description>
			<addressOffset>0x224</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PKT_LNGTH</name>
					<description>The remaining number of bytes to be written to the selected endpoint buffer. This field is decremented by 4 by hardware after each write to USBTxData. When this field decrements to 0, the TxENDPKT bit will be set in USBDevIntSt.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL</name>
			<description>USB Control</description>
			<addressOffset>0x228</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RD_EN</name>
					<description>Read mode control. Enables reading data from the OUT endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBRxData register. This bit is cleared by hardware when the last word of the current packet is read from USBRxData.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WR_EN</name>
					<description>Write mode control. Enables writing data to the IN endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBTxData register. This bit is cleared by hardware when the number of bytes in USBTxLen have been sent.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LOG_ENDPOINT</name>
					<description>Logical Endpoint number.</description>
					<bitRange>[5:2]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CMDCODE</name>
			<description>USB Command Code</description>
			<addressOffset>0x210</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:0]</bitRange>

				</field>
				<field>
					<name>CMD_PHASE</name>
					<description>The command phase:</description>
					<bitRange>[15:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>READ</name>
							<description>Read</description>
							<value>0x02</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITE</name>
							<description>Write</description>
							<value>0x01</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMMAND</name>
							<description>Command</description>
							<value>0x05</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMD_CODE_WDATA</name>
					<description>This is a multi-purpose field. When CMD_PHASE is Command or Read, this field contains the code for the command (CMD_CODE). When CMD_PHASE is Write, this field contains the command write data (CMD_WDATA).</description>
					<bitRange>[23:16]</bitRange>

