pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>EPNDDINTCLR24</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[24:24]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR25</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[25:25]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR26</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[26:26]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR27</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[27:27]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR28</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[28:28]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR29</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[29:29]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR30</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[30:30]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR31</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[31:31]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>NDDRINTSET</name>
			<description>USB New DD Request Interrupt Set</description>
			<addressOffset>0x2B4</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPNDDINTSET0</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET1</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET2</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET3</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET4</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET5</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET6</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET7</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET8</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET9</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET10</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTSET11</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
