pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>EPERRINTCLR26</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[26:26]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR27</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[27:27]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR28</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[28:28]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR29</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[29:29]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR30</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[30:30]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR31</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[31:31]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SYSERRINTSET</name>
			<description>USB System Error Interrupt Set</description>
			<addressOffset>0x2C0</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPERRINTSET0</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET1</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET2</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET3</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET4</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET5</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET6</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET7</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET8</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET9</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET10</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET11</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTSET12</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Set the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[12:12]</bitRange>
										
