pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
			</registers>
		</peripheral>
	
	

		
		<peripheral>
	<name>GPIO</name>
	<description>GPIO</description>
	<groupName>GPIO</groupName>
	<baseAddress>0x20098000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>DIR%s</name>
			
			<description>GPIO Port Direction control register.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PDIR0</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PDIR1</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>PDIR2</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>PDIR3</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>PDIR4</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PDIR5</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PDIR6</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PDIR7</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PDIR8</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>PDIR9</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>PDIR10</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>PDIR11</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>PDIR12</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>PDIR13</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>PDIR14</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>PDIR15</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>PDIR16</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>PDIR17</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>PDIR18</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>PDIR19</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>PDIR20</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>PDIR21</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>PDIR22</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>PDIR23</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>PDIR24</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>PDIR25</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>PDIR26</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>PDIR27</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PDIR28</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>PDIR29</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>PDIR30</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>PDIR31</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in xDIR controls pin Px[0], bit 31 in xDIR controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>MASK%s</name>
			
