pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
	</registers>
		</peripheral>
		<peripheral>
	<name>EMC</name>
	<description>External Memory Controller (EMC)</description>
	<groupName>EMC</groupName>
	<baseAddress>0X2009C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<name>CONTROL</name>
			<description>Controls operation of the memory controller.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x3</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>E</name>
					<description>EMC Enable. Indicates if the EMC is enabled or disabled:</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled
(POR and warm reset value).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>M</name>
					<description>Address mirror. Indicates normal or reset memory map:</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL</name>
							<description>Normal memory map.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET</name>
							<description>Reset memory map. Static memory EMC_CS1 is
mirrored onto EMC_CS0 and EMC_DYCS0 (POR reset value).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>L</name>
					<description>Low-power mode. Indicates normal, or low-power mode:</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WARMRESET</name>
							<description>Normal mode (warm
reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOWPOWER</name>
							<description>Low-power
mode. Entering low-power mode reduces memory controller power consumption.
Dynamic memory is refreshed as necessary. The memory controller
returns to normal functional mode by clearing the low-power mode
bit (L), or by POR. This bit must only be modified when the EMC
is in idle state.[1]</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:3]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>STATUS</name>
			<description>Provides EMC status information.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-only</access>
			<resetValue>0x5</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>B</name>
					<description>Busy. This bit is used to ensure that the memory controller enters the low-power or disabled mode cleanly by determining if the memory controller is busy or not.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IDLE</name>
							<description>EMC
is idle (warm reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BUSY</name>
							<description>EMC
is busy performing memory transactions, commands, auto-refresh cycles,
or is in self-refresh mode (POR reset value).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S</name>
					<description>Write buffer status.This bit enables the EMC to enter low-power mode or disabled mode cleanly.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EMPTY</name>
							<description>Write buffers
empty (POR reset value)</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA</name>
							<description>Write
buffers contain data.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SA</name>
					<description>Self-refresh acknowledge. This bit indicates the operating mode of the EMC.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL</name>
							<description>Normal mode</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELFREFRESH</name>
							<description>Self-refresh mode (POR reset value).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:3]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CONFIG</name>
			<description>Configures operation of the memory controller</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EM</name>
					<description>Endian mode. On power-on reset, the value of the endian bit is 0. All data must be flushed in the EMC before switching between little-endian and big-endian modes.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LITTLEENDIAN</name>
							<description>Little-endian
mode (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BIGENDIAN</name>
							<description>Big-endian
mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:1]</bitRange>

