pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>MD</name>
					<description>Memory device.</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SDRAM_POR_RESET_VAL</name>
							<description>SDRAM (POR reset value).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_POWER_SDRAM_</name>
							<description>Low-power SDRAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[6:5]</bitRange>

				</field>
				<field>
					<name>AM0</name>
					<description>See Table 133. 000000 = reset value.[1]</description>
					<bitRange>[12:7]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[13:13]</bitRange>

				</field>
				<field>
					<name>AM1</name>
					<description>See  Table 133. 0 = reset value.</description>
					<bitRange>[14:14]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[18:15]</bitRange>

				</field>
				<field>
					<name>B</name>
					<description>Buffer enable.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BUFFER_DISABLED_FOR_</name>
							<description>Buffer disabled for accesses to this chip select (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BUFFER_ENABLED_FOR_A</name>
							<description>Buffer enabled for accesses to this chip select.[2]</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>P</name>
					<description>Write protect.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WRITES_NOT_PROTECTED</name>
							<description>Writes not protected (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITES_PROTECTED_</name>
							<description>Writes protected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:21]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>DYNAMICRASCAS%s</name>
			
			<description>RAS and CAS latencies for EMC_DYCS0.</description>
			<addressOffset>0x104</addressOffset>
			<access>read-write</access>
			<resetValue>0x303</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RAS</name>
					<description>RAS latency (active to read/write delay).</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONE_CCLK_CYCLE_</name>
							<description>One CCLK cycle.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TWO_CCLK_CYCLES_</name>
							<description>Two CCLK cycles.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THREE_CCLK_CYCLES_P</name>
							<description>Three CCLK cycles (POR reset value).</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[7:2]</bitRange>

				</field>
				<field>
					<name>CAS</name>
					<description>CAS latency.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONE_CCLK_CYCLE_</name>
							<description>One CCLK cycle.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TWO_CCLK_CYCLES_</name>
							<description>Two CCLK cycles.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THREE_CCLK_CYCLES_P</name>
							<description>Three CCLK cycles (POR reset value).</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:10]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICCONFIG%s</name>
			
			<description>Configuration for EMC_CS0.</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MW</name>
					<description>Memory width.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>8_BIT_POR_RESET_VAL</name>
							<description>8 bit (POR reset value).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>16_BIT_</name>
							<description>16 bit.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32_BIT_</name>
							<description>32 bit.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[2:2]</bitRange>

