pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>CMP_T0CAP2</name>
					<description>Selects the input for Timer 0 capture input 2.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMP0</name>
							<description>T0CAP2 is connected to comparator 0 level output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMP1</name>
							<description>T0CAP2 is connected to comparator 1 level output.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_T0CAP3</name>
					<description>Selects the input for Timer 0 capture input 3.</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMP0</name>
							<description>T0CAP3 is connected to comparator 0 edge output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMP1</name>
							<description>T0CAP3 is connected to comparator 1 edge output.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_T1CAP2</name>
					<description>Selects the input for Timer 1 capture input 2.</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMP1</name>
							<description>T1CAP2 is connected to comparator 1 edge output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMP0</name>
							<description>T1CAP2 is connected to comparator 0 level output.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP_T1CAP3</name>
					<description>Selects the input for Timer 1 capture input 3.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>COMP1</name>
							<description>T1CAP3 is connected to comparator 1 level output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMP0</name>
							<description>T1CAP3 is connected to comparator 0 edge output.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
				
				</field>
			</fields>
		</register>
		<register>
			<name>CTRL0</name>
			<description>Comparator 0 control register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMP0_EN</name>
					<description>Comparator 0 enable control.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Comparator 0 disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_DEEPSLP_PWRDWN</name>
							<description>Comparator 0 is disabled in Deep Sleep and Power-down modes and re-enabled automatically when exiting those modes.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DIS_PWRDWN</name>
							<description>Comparator 0 is disabled in Power-down mode and re-enabled automatically when exiting Power-down.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Comparator 0 is enabled.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP0_OE</name>
					<description>Comparator 0 output enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Comparator 0 output is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Comparator 0 output is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMP0_STAT</name>
					<description>Comparator 0 status. This bit reflects the comparator 0 output, and is not affected by CMP0_OE.</description>
					<bitRange>[3:3]</bitRange>
				
				</field>
				<field>
					<name>CMP0_VM</name>
					<description>Comparator 0 VM input select.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_0_</name>
							<description>Vref divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN0</name>
							<description>CMP0_IN[0].</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN1</name>
							<description>CMP0_IN[1].</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN2</name>
							<description>CMP0_IN[2].</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP0_IN3</name>
							<description>CMP0_IN[3].</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP1_IN0</name>
							<description>CMP1_IN[0].</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0_9_V_BAND_</name>
							<description>internal 0.9 V band gap reference.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMPERATURE_SENSOR_</name>
							<description>temperature sensor.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
				
