pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
				</field>
				<field>
					<name>INTWAKE_EN1</name>
					<description>Interrupt and wakeup enable for channel 1.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_OR_WAKE</name>
							<description>No interrupt or wakeup will be generated by event channel 1.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WAKEUP</name>
							<description>An event in channel 1 will trigger an (RTC) interrupt and a wake-up request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPCLEAR_EN1</name>
					<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 1.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOGPREG</name>
							<description>Channel 1 has no influence on the general purpose registers.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLRGPREG</name>
							<description>A n event in channel 1 will clear the general purpose registers asynchronously.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>POL1</name>
					<description>Selects the polarity of an event on input pin RTC_EV1.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NEG</name>
							<description>A channel 1 event is defined as a negative edge on RTC_EV1.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POS</name>
							<description>A channel 1 event is defined as a positive edge on RTC_EV1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EV1_INPUT_EN</name>
					<description>Event enable control for channel 1.[1]</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Event 1 input is disabled and forced high internally.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Event 1 input is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[19:14]</bitRange>

				</field>
				<field>
					<name>INTWAKE_EN2</name>
					<description>Interrupt and wakeup enable for channel 2.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_OR_WAKE</name>
							<description>No interrupt or wakeup will be generated by event channel 2.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WAKEUP</name>
							<description>An event in channel 2 will trigger an (RTC) interrupt and a wake-up request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPCLEAR_EN2</name>
					<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 2.</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOGPREG</name>
							<description>Channel 2 has no influence on the general purpose registers.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLRGPREG</name>
							<description>An event in channel 2 will clear the general purpose registers asynchronously.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>POL2</name>
					<description>Selects the polarity of an event on input pin RTC_EV2.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NEG</name>
							<description>A channel 2 event is defined as a negative edge on RTC_EV2.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POS</name>
							<description>A channel 2 event is defined as a positive edge on RTC_EV2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EV2_INPUT_EN</name>
					<description>Event enable control for channel 2.[1]</description>
					<bitRange>[23:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Event 2 input is disabled and forced high internally.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Event 2 input is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[29:24]</bitRange>

				</field>
				<field>
					<name>ERMODE</name>
					<description>Controls enabling the Event Monitor/Recorder and selecting its operating frequency.[2]</description>
					<bitRange>[31:30]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Event Monitor/Recorder clocks are disabled. Operation of the Event Monitor/Recorder is disabled except for asynchronous clearing of GP registers if selected.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_EVENT_MONITOR16HZ</name>
							<description>Enable Event Monitor/Recorder and select a 16 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 62.5 ms to 125 ms will be filtered out.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_EVENT_MONITOR64HZ</name>
							<description>Enable Event Monitor/Recorder and select a 64 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 15.6 ms to 31.2 ms will be filtered out.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_EVENT_MONITOR1KHZ</name>
							<description>Enable Event Monitor/Recorder and select a 1 kHz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 1 ms to 2 ms will be filtered out.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<name>ERSTATUS</name>
			<description>Event Monitor/Recorder Status register. Contains status flags for event channels and other Event Monitor/Recorder conditions.</description>
			<addressOffset>0x080</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EV0</name>
					<description>Event flag for channel 0 (RTC_EV0 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EVENT_CHANGE_ON_C</name>
							<description>No event change on channel 0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AT_LEAST_ONE_EVENT_H</name>
							<description>At least one event has occurred on channel 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EV1</name>
					<description>Event flag for channel 1 (RTC_EV1 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EVENT_CHANGE_ON_C</name>
							<description>No event change on channel 1.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AT_LEAST_ONE_EVENT_H</name>
							<description>At least one event has occurred on channel 1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EV2</name>
					<description>Event flag for channel 2 (RTC_EV2 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EVENT_CHANGE_ON_C</name>
							<description>No event change on channel 2.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AT_LEAST_ONE_EVENT_H</name>
							<description>At least one event has occurred on channel 2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GP_CLEARED</name>
					<description>General purpose register asynchronous clear flag. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOGPCLR</name>
							<description>General purpose registers have not been asynchronous cleared.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>GPCLR</name>
							<description>General purpose registers have been asynchronous cleared.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[30:4]</bitRange>

