pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
	</registers>
</peripheral>
<peripheral>
	<name>SYSCON</name>
	<description> System and clock control </description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x400FC000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>EINT0</name>
	<value>18</value>
	</interrupt>
	<interrupt>
	<name>EINT1</name>
	<value>19</value>
	</interrupt>
	<interrupt>
	<name>EINT2</name>
	<value>20</value>
	</interrupt>
	<interrupt>
	<name>EINT3</name>
	<value>21</value>
	</interrupt>
	<interrupt>
	<name>BOD</name>
	<value>23</value>
	</interrupt>
		<registers>		
			<register>										
				<name>FLASHCFG</name>									
				<description>Flash Accelerator Configuration Register. Controls flash access timing.</description>									
				<addressOffset>0x000</addressOffset>									
				<access>read-write</access>									
				<resetValue>0</resetValue>									
				<resetMask>0xFFFFFFFF</resetMask>									
				<fields>									
					<field>								
						<name>RESERVED</name>							
						<description>Reserved, user software should not change these bits from the reset value.</description>							
						<bitRange>[11:0]</bitRange>							
												
					</field>								
					<field>								
						<name>FLASHTIM</name>							
						<description>Flash access time. The value of this field plus 1 gives the number of CPU clocks used for a flash access. Warning: improper setting of this value may result in incorrect operation of the device. All other values are reserved.</description>							
						<bitRange>[15:12]</bitRange>							
						<enumeratedValues>							
							<name>ENUM</name>							
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_1</name>					
								<description>Flash accesses use 1 CPU clock. Use for up to 20 MHz CPU clock with power boost off.</description>					
								<value>0x0</value>					
							</enumeratedValue>						
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_2</name>					
								<description>Flash accesses use 2 CPU clocks. Use for up to 40 MHz CPU clock with power boost off.</description>					
								<value>0x1</value>					
							</enumeratedValue>						
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_3</name>					
								<description>Flash accesses use 3 CPU clocks. Use for up to 60 MHz CPU clock with power boost off.</description>					
								<value>0x2</value>					
							</enumeratedValue>						
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_4</name>					
								<description>Flash accesses use 4 CPU clocks. Use for up to 80 MHz CPU clock with power boost off. Use this setting for operation from 100 to 120 MHz operation with power boost on.</description>					
								<value>0x3</value>					
							</enumeratedValue>						
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_5</name>					
								<description>Flash accesses use 5 CPU clocks. Use for up to 100 MHz CPU clock with power boost off.</description>					
								<value>0x4</value>					
							</enumeratedValue>						
							<enumeratedValue>						
								<name>FLASH_ACCESSES_USE_6</name>					
								<description>Flash accesses use 6 CPU clocks. Safe setting for any allowed conditions.</description>					
								<value>0x5</value>					
							</enumeratedValue>						
						</enumeratedValues>							
					</field>								
					<field>								
						<name>RESERVED</name>							
						<description>Reserved. Read value is undefined, only zero should be written.</description>							
						<bitRange>[31:16]</bitRange>							
												
					</field>								
				</fields>									
			</register>										
			
	<register>																						
		<dim>2</dim>																					
		<dimIncrement>0x20</dimIncrement>																					
		<dimIndex>0-1</dimIndex>																					
		<name>PLLCON%s</name>																					
		<description>PLL0 Control register</description>																					
		<addressOffset>0x080</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PLLE</name>																			
				<description>PLL Enable. When one, and after a valid PLL feed, this bit will activate the related PLL and allow it to lock to the requested frequency. See PLLSTAT register, Table 12.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:1]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>2</dim>																					
		<dimIncrement>0x20</dimIncrement>																					
		<dimIndex>0-1</dimIndex>																					
		<name>PLLCFG%s</name>																					
		<description>PLL0 Configuration register</description>																					
		<addressOffset>0x084</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MSEL</name>																			
				<description>PLL Multiplier value. Supplies the value "M" in the PLL frequency calculations. Note: For details on selecting the right value for MSEL see Section 3.10.4.</description>																			
				<bitRange>[4:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>PSEL</name>																			
				<description>PLL Divider value. Supplies the value "P" in the PLL frequency calculations. Note: For details on selecting the right value for PSEL see Section 3.10.4.</description>																			
				<bitRange>[6:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:7]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>2</dim>																					
		<dimIncrement>0x20</dimIncrement>																					
		<dimIndex>0-1</dimIndex>																					
		<name>PLLSTAT%s</name>																					
		<description>PLL0 Status register</description>																					
		<addressOffset>0x088</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MSEL</name>																			
				<description>Read-back for the PLL Multiplier value. This is the value currently used by the related PLL.</description>																			
				<bitRange>[4:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>PSEL</name>																			
				<description>Read-back for the PLL Divider value. This is the value currently used by the related PLL.</description>																			
				<bitRange>[6:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[7:7]</bitRange>																			
			</field>																				
			<field>																				
				<name>PLLE_STAT</name>																			
				<description>Read-back for the PLL Enable bit. When one, the related PLL is currently activated. When zero, the related PLL is turned off. This bit is automatically cleared when Power-down mode is activated.</description>																			
				<bitRange>[8:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[9:9]</bitRange>																			
			</field>																				
			<field>																				
				<name>PLOCK</name>																			
				<description>Reflects the PLL Lock status. When zero, the related PLL is not locked. When one, the related PLL is locked onto the requested frequency.</description>																			
				<bitRange>[10:10]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[31:11]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>2</dim>																					
		<dimIncrement>0x20</dimIncrement>																					
		<dimIndex>0-1</dimIndex>																					
		<name>PLLFEED%s</name>																					
		<description>PLL0 Feed register</description>																					
		<addressOffset>0x08C</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0x00000000</resetMask>																					
		<fields>																					
			<field>																				
				<name>PLLFEED</name>																			
				<description>The PLL feed sequence must be written to this register in order for the related PLL's configuration and control register changes to take effect.</description>																			
				<bitRange>[7:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:8]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PCON</name>																					
		<description>Power Control register</description>																					
		<addressOffset>0x0C0</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PM0</name>																			
				<description>Power mode control bit 0. This bit controls entry to the Power-down mode. See Section 3.3.6.1 below for details.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>PM1</name>																			
				<description>Power mode control bit 1. This bit controls entry to the Deep Power-down mode. See Section 3.3.6.1 below for details.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>BODRPM</name>																			
				<description>Brown-Out Reduced Power Mode. When BODRPM is 1, the Brown-Out Detect circuitry will be turned off when chip Power-down mode or Deep Sleep mode is entered, resulting in a further reduction in power usage. However, the possibility of using Brown-Out Detect as a wake-up source from the reduced power mode will be lost. When 0, the Brown-Out Detect function remains active during Power-down and Deep Sleep modes. See the System Control Block chapter for details of Brown-Out detection.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>BOGD</name>																			
				<description>Brown-Out Global Disable. When BOGD is 1, the Brown-Out Detect circuitry is fully disabled at all times, and does not consume power. When 0, the Brown-Out Detect circuitry is enabled. See the System Control Block chapter for details of Brown-Out detection.</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>BORD</name>																			
				<description>Brown-Out Reset Disable. When BORD is 1, the BOD will not reset the device when the VDD(REG)(3V3) voltage dips goes below the BOD reset trip level. The Brown-Out interrupt is not affected. When BORD is 0, the BOD reset is enabled. See the Section 3.6 for details of Brown-Out detection.</description>																			
				<bitRange>[4:4]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[7:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>SMFLAG</name>																			
				<description>Sleep Mode entry flag. Set when the Sleep mode is successfully entered. Cleared by software writing a one to this bit.</description>																			
				<bitRange>[8:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>DSFLAG</name>																			
				<description>Deep Sleep entry flag. Set when the Deep Sleep mode is successfully entered. Cleared by software writing a one to this bit.</description>																			
				<bitRange>[9:9]</bitRange>																			
			</field>																				
			<field>																				
				<name>PDFLAG</name>																			
				<description>Power-down entry flag. Set when the Power-down mode is successfully entered. Cleared by software writing a one to this bit.</description>																			
				<bitRange>[10:10]</bitRange>																			
			</field>																				
			<field>																				
				<name>DPDFLAG</name>																			
				<description>Deep Power-down entry flag. Set when the Deep Power-down mode is successfully entered. Cleared by software writing a one to this bit.</description>																			
				<bitRange>[11:11]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:12]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
