pyocd/pyOCD/pyocd/debug/svd/data/LPC408x_7x_v0.7.svd
	<register>																						
		<name>RSTCON0</name>																					
		<description>Individual peripheral reset control bits</description>																					
		<addressOffset>0x1CC</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>RSTLCD</name>																			
				<description>LCD controller reset control bit.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTTIM0</name>																			
				<description>Timer/Counter 0 reset control bit.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTTIM1</name>																			
				<description>Timer/Counter 1 reset control bit.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUART0</name>																			
				<description>UART0 reset control bit.</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUART1</name>																			
				<description>UART1 reset control bit.</description>																			
				<bitRange>[4:4]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTPWM0</name>																			
				<description>PWM0 reset control bit.</description>																			
				<bitRange>[5:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTPWM1</name>																			
				<description>PWM1 reset control bit.</description>																			
				<bitRange>[6:6]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTI2C0</name>																			
				<description>The I2C0 interface reset control bit.</description>																			
				<bitRange>[7:7]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUART4</name>																			
				<description>UART4 reset control bit.</description>																			
				<bitRange>[8:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTRTC</name>																			
				<description>RTC and Event Monitor/Recorder reset control bit. RTC reset is limited, see Table 626 "Register overview: Real-Time Clock (base address 0x4002 4000)" for details.</description>																			
				<bitRange>[9:9]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTSSP1</name>																			
				<description>The SSP 1 interface reset control bit.</description>																			
				<bitRange>[10:10]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTEMC</name>																			
				<description>External Memory Controller reset control bit.</description>																			
				<bitRange>[11:11]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTADC</name>																			
				<description>A/D converter (ADC) reset control bit.</description>																			
				<bitRange>[12:12]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTCAN1</name>																			
				<description>CAN Controller 1 reset control bit. Note: The CAN acceptance filter may be reset by a separate bit in the RSTCON1 register.</description>																			
				<bitRange>[13:13]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTCAN2</name>																			
				<description>CAN Controller 2 reset control bit. Note: The CAN acceptance filter may be reset by a separate bit in the RSTCON1 register.</description>																			
				<bitRange>[14:14]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTGPIO</name>																			
				<description>Reset control bit for GPIO, and GPIO interrupts. Note: IOCON may be reset by a separate bit in the RSTCON1 register.</description>																			
				<bitRange>[15:15]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTSPIFI</name>																			
				<description>SPI Flash Interface reset control bit.</description>																			
				<bitRange>[16:16]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTMCPWM</name>																			
				<description>Motor Control PWM reset control bit.</description>																			
				<bitRange>[17:17]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTQEI</name>																			
				<description>Quadrature Encoder Interface reset control bit.</description>																			
				<bitRange>[18:18]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTI2C1</name>																			
				<description>The I2C1 interface reset control bit.</description>																			
				<bitRange>[19:19]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTSSP2</name>																			
				<description>The SSP2 interface reset control bit.</description>																			
				<bitRange>[20:20]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTSSP0</name>																			
				<description>The SSP0 interface reset control bit.</description>																			
				<bitRange>[21:21]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTTIM2</name>																			
				<description>Timer 2 reset control bit.</description>																			
				<bitRange>[22:22]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTTIM3</name>																			
				<description>Timer 3 reset control bit.</description>																			
				<bitRange>[23:23]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUART2</name>																			
				<description>UART 2 reset control bit.</description>																			
				<bitRange>[24:24]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUART3</name>																			
				<description>UART 3 reset control bit.</description>																			
				<bitRange>[25:25]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTI2C2</name>																			
				<description>I2C interface 2 reset control bit.</description>																			
				<bitRange>[26:26]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTI2S</name>																			
				<description>I2S interface reset control bit.</description>																			
				<bitRange>[27:27]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTSDC</name>																			
				<description>SD Card interface reset control bit.</description>																			
				<bitRange>[28:28]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTGPDMA</name>																			
				<description>GPDMA function reset control bit.</description>																			
				<bitRange>[29:29]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTENET</name>																			
				<description>Ethernet block reset control bit.</description>																			
				<bitRange>[30:30]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTUSB</name>																			
				<description>USB interface reset control bit.</description>																			
				<bitRange>[31:31]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>RSTCON1</name>																					
		<description>Individual peripheral reset control bits</description>																					
		<addressOffset>0x1D0</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>RSTIOCON</name>																			
				<description>Reset control bit for the IOCON registers.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTDAC</name>																			
				<description>D/A converter (DAC) reset control bit.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>RSTCANACC</name>																			
				<description>CAN acceptance filter reset control bit.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>		
			<field>																				
				<name>RSTCMP</name>																			
				<description>Comparator 0/1 reset control bit.</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>		
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:4]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>EMCDLYCTL</name>																					
		<description>Values for the 4 programmable delays associated with SDRAM operation.</description>																					
		<addressOffset>0x1DC</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0x210</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CMDDLY</name>																			
				<description>Programmable delay value for EMC outputs in command delayed mode. See Section 9.12.6. The delay amount is roughly (CMDDLY+1) * 250 picoseconds. This field applies only when the command delayed read strategy is selected in the EMCDynamicReadConfig register. In this mode, all control outputs from the EMC are delayed, but the output clock is not. Delaying the control outputs changes dynamic characteristics defined in the device data sheet.</description>																			
				<bitRange>[4:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[7:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>FBCLKDLY</name>																			
				<description>Programmable delay value for the feedback clock that controls input data sampling. See Section 9.5.3. The delay amount is roughly (FBCLKDLY+1) * 250 picoseconds.</description>																			
				<bitRange>[12:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[15:13]</bitRange>																			
			</field>																				
			<field>																				
				<name>CLKOUT0DLY</name>																			
				<description>Programmable delay value for the CLKOUT0 output. This would typically be used in clock delayed mode. See Section 9.12.6 The delay amount is roughly (CLKOUT0DLY+1) * 250 picoseconds. Delaying the clock output changes dynamic characteristics defined in the device data sheet.</description>																			
				<bitRange>[20:16]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[23:21]</bitRange>																			
			</field>																				
			<field>																				
				<name>CLKOUT1DLY</name>																			
				<description>Programmable delay value for the CLKOUT1 output. This would typically be used in clock delayed mode. See Section 9.12.6 The delay amount is roughly (CLKOUT1DLY+1) * 250 picoseconds.</description>																			
				<bitRange>[28:24]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:29]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>EMCCAL</name>																					
		<description>Controls the calibration counter for programmable delays and returns the result value.</description>																					
		<addressOffset>0x1E0</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0x1F00</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CALVALUE</name>																			
				<description>Returns the count of the approximately 50 MHz ring oscillator that occur during 32 clocks of the IRC oscillator. This represents the composite effect of processing variation, internal regulator supply voltage, and ambient temperature.</description>																			
				<bitRange>[7:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[13:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>START</name>																			
				<description>Start control bit for the EMC calibration counter. Writing a 1 to this bit begins the measurement process. This bit is cleared automatically when the measurement is complete.</description>																			
				<bitRange>[14:14]</bitRange>																			
			</field>																				
			<field>																				
				<name>DONE</name>																			
				<description>Measurement completion flag. this bit is set when a calibration measurement is completed. This bit is cleared automatically when the START bit is set.</description>																			
				<bitRange>[15:15]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Read value is undefined, only zero should be written.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
</registers>																							

</peripheral>
		
	

	
		
		
		
		
		
		

		
		

		
		





		

		
		
		
		
		
		
		
		

		
	</peripherals>
</device>
